package JsonParser;
/*
Домашняя работа 9.14
9.14.1 Написать код парсинга страницы Википедии “Список станций Московского метрополитена”,
который будет на основе этой страницы создавать JSON-файл со списком станций по линиям
и списком линий по формату JSON-файла из проекта SPBMetro (файл map.json, приложен к домашнему заданию)

9.14.2* Также пропарсить и вывести в JSON-файл переходы между станциями.

9.14.3 Написать код, который прочитает созданный JSON-файл и напечатает количества станций на каждой линии.
 */