package homework_44;
/*
4.4.1 Распечатать коды всех латинских букв и сами буквы.
4.4.2 С помощью методов indexOf(), lastIndexOf(), substring() и trim() написать код в проекте StringExperiments,
      который считает сумму заработка Васи и Маши.
4.4.3 Написать программу, которая на входе через консоль принимает фамилию, имя и отчество одной строкой (например,
      “Иванов Сергей Петрович”) и выводит фамилию, имя и отчество отдельно в следующем формате:
        Фамилия: Иванов
        Имя: Сергей
        Отчество: Петрович
4.4.4* Программу разделения строки на фамилию, имя и отчество сделать устойчивой к ошибкам - к неверным форматам ввода.
*/