package Homework_13_3.Task1;

/*
Задание 1.

— Ознакомьтесь с официальной документацией по командам, которые мы использовали в практике: SET, GET, KEYS, SADD, SREM, SMEMBERS.

Список команд Redis
— Воспользуйтесь инструкцией и установите redis-cli и Redis к себе на компьютер.

— Используйте соответствующие команды, чтобы сохранить в Redis список дел: “купить молока”, “заправить машину”, “покормить кота”. Убедитесь что при повторном добавлении дела в список, список не меняется.

— “Выполните” дела, удаляя их из базы один за одним.
 */