package homework_51;
/*
5.1.1 Повторить создание массива и заполнение цветами радуги, как показано в видео, а затем написать код,
      переворачивающий этот массив.
5.1.2 Создать массив с температурами 30-ти пациентов (от 32 до 40 градусов). Написать код, рассчитывающий
      среднюю температуру по больнице и количество здоровых пациентов (с температурой от 36,2 до 36,9).
5.1.3 Создать с помощью циклов массив массивов строк таким образом, чтобы при его распечатке в консоли
      печатался крестик из крестиков:
        x     x

         x   x

          x x

           x

          x x

         x   x

        x     x
 */