package homework_45;
/*
4.5.1 В проекте StringExperiments внести изменения таким образом, чтобы суммы заработков каждого
      человека извлекались из текста регулярным выражением, а в конце программы рассчитывалась и
      распечатываль общая сумма заработка всех. Приложить zip-архив изменённого проекта StringExperiments.
4.5.2 Возьмите английский текст (не менее 100 слов) и напишите программу, которая будет разбивать его
      на слова и печатать слова в консоли. Приложить zip-архив проекта.
4.5.3 Исправьте программу, написанную в уроке 4, таким образом, чтобы вводимая строка с фамилией,
      именем и отчеством разбивались с использованием регулярного выражения. Приложить zip-архив проекта.
4.5.4 Реализовать очистку номера телефона, вводимого из консоли, от лишних символов, чтобы его можно было
      вводить не только в формате 79091234567, но и с использованием лишних символов, например:
        +7 909 123-45-67
        +7 (909) 1234567
        7-909-123-45-67
        8 905 1234567
*/